Repository: zipf/perldoc-es
Catalog: tm/_Kephra_ref/kephra_es.tmx
Source language: en_us
Languages: es

source: delete marker in all open documents
es: Elimina la marca en todos los documentos abiertos

source: go to bookmark number 1
es: Salta al marcador número 1

source: go to bookmark number 2
es: Salta al marcador número 2

source: go to bookmark number 3
es: Salta al marcador número 3

source: go to bookmark number 4
es: Salta al marcador número 4

source: go to bookmark number 5
es: Salta al marcador número 5

source: go to bookmark number 6
es: Salta al marcador número 6

source: go to bookmark number 7
es: Salta al marcador número 7

source: go to bookmark number 8
es: Salta al marcador número 8

source: go to bookmark number 9
es: Salta al marcador número 9

source: go to bookmark number 0
es: Salta al marcador número 0

source: set here or remove (if present) bookmark 1
es: Establece o elimina (si existe) el marcador 1

source: set here or remove (if present) bookmark 2
es: Establece o elimina (si existe) el marcador 2

source: set here or remove (if present) bookmark 3
es: Establece o elimina (si existe) el marcador 3

source: set here or remove (if present) bookmark 4
es: Establece o elimina (si existe) el marcador 4

source: set here or remove (if present) bookmark 5
es: Establece o elimina (si existe) el marcador 5

source: set here or remove (if present) bookmark 6
es: Establece o elimina (si existe) el marcador 6

source: set here or remove (if present) bookmark 7
es: Establece o elimina (si existe) el marcador 7

source: set here or remove (if present) bookmark 8
es: Establece o elimina (si existe) el marcador 8

source: set here or remove (if present) bookmark 9
es: Establece o elimina (si existe) el marcador 9

source: set here or remove (if present) bookmark 0
es: Establece o elimina (si existe) el marcador 0

source: delete bookmarks in the current document
es: Elimina todos los marcadores del documento actual

source: delete bookmarks in all documents
es: Elimina los marcadores de todos los documentos

source: jump to the notepad
es: Salta al bloc de notas

source: paste selected text on the end of the notepad
es: Pega el texto seleccionado al final del bloc de notas

source: run current programm and show result in output panel
es: Ejecuta el programa actual y muestra el resultado en el panel de resultados

source: stop the current running output panel process
es: Detiene el proceso del panel de resultados que se está ejecutando

source: display the include paths of the Perl Interpreter in the ouput panel
es: Muestra las rutas de inclusión del intérprete de Perl en el panel de resultados

source: display the environment variables in the ouput panel
es: Muestra todas las variables de entorno en el panel de resultados

source: display selected text in decimal coding in the ouput panel
es: Muestra el texto seleccionado en codificación decimal en el panel de resultados

source: display selected text in hexadecimal coding in the ouput panel
es: Muestra el texto seleccionado en codificación hexadecimal en el panel de resultados

source: display text selection as color and choose a new from a rainbow
es: Muestra en color la selección de texto y permite elegir un color nuevo en el selector de colores

source: insert at cursor current time and date
es: Inserta en el cursor la hora y la fecha actuales

source: insert last Perl variable that began a line
es: Inserta la última variable de Perl con la que se comenzó una línea

source: copy surrounding single or double quoted string
es: Copia escribiendo la cadena entre comillas simples o dobles

source: indents new line like previous when Enter pressed
es: Aplica a la nueva línea la sangría de la anterior al presionar Entrar

source: autoindents one tab more after curly braces when press enter
es: Aplica automáticamente una sangría de tabulación adicional a continuación de las llaves al presionar Entrar

source: creates the closing brace when press enter after the opening
es: Crea la llave de cierre al presionar Entrar después de escribir la llave de apertura

source: make all line endings like in first line
es: Aplica a todas las líneas el mismo carácter de fin de línea de la primera línea

source: line endings for Windows or Dos
es: Caracteres de fin de línea para Windows o DOS

source: convert line endings to the Mac standart
es: Convierte los caracteres de fin de línea al estándar Mac

source: convert line endings to the UNIX standart
es: Convierte los caracteres de fin de línea al estándar UNIX

source: switches to the last used document
es: Pasa al último documento usado

source: changes the current document one tab to the left
es: El documento actual pasa a ser el de la pestaña de la izquierda

source: changes the current document one tab to the right
es: El documento actual pasa a ser el de la pestaña de la derecha

source: converts document encoding into 8 Bit ASCII
es: Convierte la codificación del documento en ASCII de 8 bits

source: converts document encoding into iso-8859-1
es: Convierte la codificación del documento en ISO-8859-1

source: converts document encoding into UTF-8
es: Convierte la codificación del documento en UTF-8

source: move current document in the tabbar one pos to the left
es: Mueve el documento actual una posición a la izquierda en la barra de pestañas

source: move current document in the tabbar one pos to the right
es: Mueve el documento actual una posición a la derecha en la barra de pestañas

source: turns write protection on if file is readonly
es: Activa la protección contra escritura si el archivo es de sólo lectura

source: disables every modification of this document
es: Deshabilita los cambios en este documento

source: makes document always editable even if it can't be saved
es: Hace que el documento siempre se pueda editar aunque no se pueda guardar

source: select syntaxmode depending on fileending
es: Selecciona el modo de sintaxis en función de la extensión del nombre de archivo

source: turn any syntaxmode settings off
es: Desactiva la configuración de modo de sintaxis

source: activate language settings for Ada
es: Modo de sintaxis para Ada

source: activate settings for Macromedia Actionscript
es: Modo de sintaxis para Macromedia ActionScript

source: language settings for Assembler
es: Modo de sintaxis para Assembler

source: open settings for the Avennue language
es: Modo de sintaxis para Avennue

source: language of the Baan ERP systems
es: Modo de sintaxis para el lenguaje de los sistemas ERP Baan

source: Microsofts classic commandline batch control language
es: Modo de sintaxis para el lenguaje de control de procesamiento por lotes de línea de comandos clásico de Microsoft

source: settings for the C / C++ language family
es: Modo de sintaxis para la familia de lenguajes C / C++

source: for Apache Conf styled configuration files
es: Modo de sintaxis para archivos de configuración tipo Conf de Apache

source: settings for the ConTeXt Tex Macros
es: Modo de sintaxis para macros Tex de ConTeXt

source: syntaxmode for Microsoft C-Sharp
es: Modo de sintaxis para Microsoft C-Sharp

source: syntaxmode for Cascading Style Sheet language
es: Modo de sintaxis para CSS (Cascading Style Sheets)

source: syntaxmode for patch files
es: Modo de sintaxis para archivos de revisión

source: Bertrand Meyers objectoriented language Eiffel
es: Modo de sintaxis para el lenguaje orientado a objetos Eiffel de Bertrand Meyers

source: syntaxmode for errorcode files
es: Modo de sintaxis para archivos de código de error

source: language of the Forth systems
es: Modo de sintaxis para el lenguaje de los sistemas Forth

source: syntaxmode of the FORmula TRANslation language
es: Modo de sintaxis para el lenguaje Fortran (FORmula TRANslation)

source: syntaxmode for the HyperText Markup Language
es: Modo de sintaxis para el lenguaje HTML (HyperText Markup Language)

source: syntaxmode of the Interface Definition Language
es: Modo de sintaxis para el lenguaje de definición de interfaz (IDL)

source: Settings for Sun's Java language
es: Modo de sintaxis para el lenguaje Java de Sun

source: syntaxmode for Javascript
es: Modo de sintaxis para JavaScript

source: syntaxmode for the LaTeX Tex macros
es: Modo de sintaxis para macros Tex de LaTeX

source: LISt Processor settings
es: Modo de sintaxis para LISP (LISt Processor)

source: syntaxmode for the embedding language Lua
es: Modo de sintaxis para el lenguaje incrustado Lua

source: highlighting for make tool scripts
es: Modo de sintaxis para resaltado de scripts de la herramienta make

source: MATLAB scripting language
es: Modo de sintaxis para el lenguaje de scripting de MATLAB

source: language of the Nullsoft Scriptable Install System
es: Modo de sintaxis para el lenguaje de scripts de instalación de Nullsoft

source: Niklaus Wirth's structured language Pascal
es: Modo de sintaxis para el lenguaje estructurado Pascal de Niklaus Wirth

source: syntaxmode for Larry Walls Perl
es: Modo de sintaxis para el lenguaje Perl de Larry Wall

source: Rasmus Lehrdorf PHP Hypertext Processors
es: Modo de sintaxis para el lenguaje PHP (PHP Hypertext Pre-processor) de Rasmus Lehrdorf

source: Highlighting for simple config files
es: Modo de sintaxis para resaltado de archivos de configuración sencillos

source: Adobe's document desciption language Postscript
es: Modo de sintaxis para el lenguaje PostScript de descripción de documentos de Adobe

source: Guido van Rossums dynamic language Python
es: Modo de sintaxis para el lenguaje dinámico Python de Guido van Rossum

source: Yukihiro "Matz" Matsumoto's full objectoriented language
es: Modo de sintaxis para el lenguaje totalmente orientado a objetos Ruby de Yukihiro "Matz" Matsumoto

source: syntaxmode of the MIT LISP dialect
es: Modo de sintaxis para el dialecto de LISP del MIT

source: settings for the UNIX Bourne Shell
es: Modo de sintaxis para Bourne Shell de UNIX

source: Structured Query Language originated from IBM
es: Modo de sintaxis para el lenguaje SQL (Structured Query Language) de IBM

source: Tool Command Language from John Ousterhout
es: Modo de sintaxis para el lenguaje TCL (Tool Command Language) de Ousterhout

source: Donald E. Knuth macro language for type setting
es: Modo de sintaxis para el lenguaje de macros para composición tipográfica de Donald E. Knuth

source: settings for Microsoft Visual Basic
es: Modo de sintaxis para Microsoft Visual Basic

source: settings for Microsoft Visual Basic Script
es: Modo de sintaxis para Microsoft VBScript

source: syntaxmode for the eXtensible Markup Language
es: Modo de sintaxis para XML (eXtensible Markup Language)

source: syntaxmode for Indy's YAML Ain't Markup Language
es: Modo de sintaxis para el lenguaje YAML (Ain't Markup Language) de Ingy

source: insert a tab while hitting the tab key
es: Inserta una tabulación al presionar la tecla Tab

source: insert several whitespaces while hitting tab key
es: Inserta varios espacios en blanco al presionar la tecla Tab

source: use tabs (hard tabs) or whitespaces (soft tabs)
es: Permite seleccionar tabulaciones o espacios en blanco

source: set width of tabs to an equal of 1 character
es: Establece el ancho de tabulación en 1 carácter

source: set width of tabs to an equal of 2 characters
es: Establece el ancho de tabulación en 2 caracteres

source: set width of tabs to an equal of 3 characters
es: Establece el ancho de tabulación en 3 caracteres

source: set width of tabs to an equal of 4 characters
es: Establece el ancho de tabulación en 4 caracteres

source: set width of tabs to an equal of 5 characters
es: Establece el ancho de tabulación en 5 caracteres

source: set width of tabs to an equal of 6 characters
es: Establece el ancho de tabulación en 6 caracteres

source: set width of tabs to an equal of 8 characters
es: Establece el ancho de tabulación en 8 caracteres

source: display and change the configuration of the program
es: Muestra y permite modificar la configuración del programa

source: open dialog for text search and settings
es: Abre el cuadro de diálogo de configuración de búsqueda de texto

source: open dialog for find and replace text
es: Abre el cuadro de diálogo de búsqueda y sustitución de texto

source: version numbers, authors, credits, license
es: Números de versión, autores, créditos, licencia

source: lists which key kombination triggers which function
es: Muestra las combinaciones de teclas que activan cada función

source: introduction of unusual but practical features
es: Presentación de características inusuales pero prácticas

source: list of all involved people
es: Lista de participantes en el proyecto

source: thematically sorted description of all functionalities
es: Descripción de todas las funcionalidades clasificadas por temas

source: explanations of the user interface
es: Descripción de la interfaz de usuario

source: first steps: how to get help and give feedback
es: Primeros pasos: cómo obtener y proporcionar ayuda

source: new features and important changes of the current version
es: Nuevas características y cambios importantes en la versión actual

source: activate customizable editpanel context menu
es: Activa el menú contextual del panel de edición personalizable

source: activate default scintilla context menu
es: Activa el menú contextual predeterminado de Scintilla

source: deactivate all editpanel context menu
es: Desactiva todos los menús contextuales del panel de edición

source: switch visibility of the end of line marker
es: Muestra u oculta la marca de fin de línea

source: highlights row where caret(textcursor) is located
es: Resalta la línea en la que se encuentra el símbolo de intercalación (cursor de texto)

source: highlights associated pairs of braices
es: Resalta los pares de llaves relacionados

source: vertical dotted lines in intervals of tab width
es: Líneas verticales punteadas en los intervalos del ancho de tabulación

source: shows straight vertical line on seleted width
es: Muestra una línea recta vertical en el ancho seleccionado

source: set whitespaces and tabs visible as dots and arrows
es: Hace visibles los espacios en blanco y las tabulaciones como puntos y flechas

source: fold or unfold all visible and not visible nodes
es: Pliega o despliega todos los nodos visible y los no visibles

source: fold or unfold only the node on selected position
es: Pliega o despliega sólo el nodo de la posición seleccionada

source: fold or unfold all nodes with same depth in hierarchy (amount of parents)
es: Pliega o despliega todos los nodos con la misma profundidad (cantidad de nodos primarios) en la jerarquía

source: fold or unfold this and all nodes below in hierarchy
es: Pliega o despliega este nodo y todos sus nodos secundarios en la jerarquía

source: change font family, size, style etc.
es: Permite cambiar el tipo de fuente, el tamaño, el estilo, etc.

source: breaks long lines on window edge only visually
es: Interrumpe líneas largas en el borde de la ventana sólo visualmente

source: enable or disable the context menu over the margin, left of the edit panel
es: Habilita o deshabilita el menú contextual en el margen, a la izquierda del panel de edición

source: margin for bookmarks, marker, debug steps ...
es: Margen para marcadores, marcas, pasos de depuración...

source: sets line numbers visible
es: Muestra los números de línea

source: switch Margin for the text folding icons
es: Muestra u oculta el margen de los iconos de plegado de texto

source: set extra margin on both sides of textfield to 0 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 0 píxeles

source: set extra margin on both sides of textfield to 1 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 1 píxel

source: set extra margin on both sides of textfield to 2 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 2 píxeles

source: set extra margin on both sides of textfield to 3 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 3 píxeles

source: set extra margin on both sides of textfield to 4 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 4 píxeles

source: set extra margin on both sides of textfield to 6 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 6 píxeles

source: set extra margin on both sides of textfield to 8 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 8 píxeles

source: set extra margin on both sides of textfield to 10 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 10 píxeles

source: set extra margin on both sides of textfield to 12 pixel
es: Establece el margen adicional de ambos lados del campo de texto en 12 píxeles

source: toggle all panels and bars to enlarge the edit area
es: Oculta todos los paneles y barras para ampliar el área de edición

source: make text appear larger
es: Aumenta el tamaño del texto

source: zoom text back to font settings
es: Restablece el tamaño de fuente configurado en el texto

source: make text appear smaller
es: Reduce el tamaño del texto

source: switch visibility of the Notepad panel
es: Muestra u oculta el panel de bloc de notas

source: switch visibility of the Output panel
es: Muestra u oculta el panel de resultados

source: turn main menu on (visible) or off
es: Muestra (u oculta) el menú principal

source: toolbar with text seach and navigation functions
es: Muestra u oculta la barra de herramientas con funciones de búsqueda de texto y navegación

source: goto searchbar and use find function
es: Va a la barra de búsqueda para usar la función de búsqueda

source: enable or disable the context menu over the searchbar
es: Habilita o deshabilita el menú contextual de la barra de búsqueda

source: switch visibility of the statusbar on bottom of the window
es: Muestra u oculta la barra de estado en la parte inferior de la ventana

source: enable or disable context menus on statusbar
es: Habilita o deshabilita los menús contextuales en la barra de estado

source: display change date of the current file in statusbar info field
es: Muestra la fecha de cambio del archivo actual en el campo de información de la barra de estado

source: display size info of the current file in statusbar info field
es: Muestra la información de tamaño del archivo actual en el campo de información de la barra de estado

source: display nothing in statusbar info field
es: No muestra nada en el campo de información de la barra de estado

source: switch visibility of the tabbar, toolbar for doc selection
es: Cambia la visibilidad de la barra de pestañas y la barra de herramientas de selección de documentos

source: enable or disable context menus on tabbar
es: Habilita o deshabilita los menús contextuales en la barra de pestañas

source: switch visibility of the main toolbar
es: Cambia la visibilidad de la barra de herramientas principal

source: please report any problem with the programm
es: Permite notificar problemas del programa

source: open online documentation with your default browser
es: Abre la documentación en línea con el navegador predeterminado

source: report a feature or design change wish
es: Permite notificar una solicitud de característica o de cambio de diseño

source: go to a perl web forum based on current language setting
es: Va a un foro de Perl en Internet en función del idioma actual

source: use maximum screen space
es: Usa el máximo espacio de pantalla

source: application window cant be overlapped by other windows
es: Impide superponer otras ventanas a la ventana de la aplicación

source: make main window translucent
es: Hace que la ventana principal sea translúcida

source: change user interface language to
es: Cambia el idioma de la interfaz de usuario a

source: open file with current global configurations
es: Abre el archivo con la configuración global actual

source: reload current global configuration file
es: Vuelve a cargar el archivo de configuración global actual

source: load global configs from chosen file
es: Carga la configuración global desde el archivo seleccionado

source: load global configs from backup
es: Carga la configuración global desde la copia de seguridad

source: load default global configs
es: Carga la configuración global predeterminada

source: merge current global configs with settings in this file
es: Combina la configuración global actual con la configuración de este archivo

source: save current global configs into the file we load from
es: Guarda la configuración global actual en el archivo desde el que se cargó

source: save current global configs into this file
es: Guarda la configuración global actual en este archivo

source: definition for function calls, key binding, icons
es: Definición de llamadas a función, asociaciones de teclas e iconos

source: open definition file for the menubar
es: Abre el archivo de definiciones para la barra de menús

source: open definition file for all contextmenu
es: Abre el archivo de definiciones para todos los menús contextuales

source: open default definition file for toolbars
es: Abre el archivo de definiciones predeterminado para las barras de herramientas

source: open definition file for the main toolbar
es: Abre el archivo de definiciones para la barra de herramientas principal

source: open definition file for the searchbar
es: Abre el archivo de definiciones para la barra de búsqueda

source: open definition file for the statusbar
es: Abre el archivo de definiciones para la barra de estado

source: open translation file for language
es: Abre el archivo de traducciones para el idioma

source: open file with settings for the Ada language
es: Abre el archivo de configuración del lenguaje Ada

source: open file with Macromedia Actionscript settings
es: Modo de sintaxis para Macromedia ActionScript

source: open file with language settings for Assembler
es: Modo de sintaxis para Assembler

source: open file with settings for the C / C++ languages
es: Modo de sintaxis para la familia de lenguajes C / C++

source: settings for files in the Apache Conf style
es: Modo de sintaxis para archivos tipo Conf de Apache

source: settings for ConTeXt Tex Macros
es: Modo de sintaxis para macros Tex de ConTeXt

source: open file with syntaxmode for Microsoft C-Sharp
es: Modo de sintaxis para Microsoft C-Sharp

source: settings for the Cascading Style Sheet language
es: Modo de sintaxis para CSS (Cascading Style Sheets)

source: settings for the language of the Forth systems
es: Modo de sintaxis para el lenguaje de los sistemas Forth

source: syntaxmode von FORmula TRANslation open
es: Modo de sintaxis para Fortran (FORmula TRANslation)

source: syntaxmode for HyperText Markup Language open
es: Modo de sintaxis para HTML (HyperText Markup Language)

source: syntaxmode der Interface Definition Language open
es: Modo de sintaxis para el lenguaje de definición de interfaz (IDL)

source: open settings for Sun's Java language
es: Modo de sintaxis para el lenguaje Java de Sun

source: open syntaxmode for Javascript
es: Modo de sintaxis para JavaScript

source: open syntaxmode for the Tex macros named LaTeX
es: Modo de sintaxis para el lenguaje LaTeX de macros de Tex

source: open settings for the almighty LISt Processor
es: Modo de sintaxis para LISP (LISt Processor)

source: settings for the extension language Lua
es: Modo de sintaxis del lenguaje de extensión Lua

source: settings for Niklaus Wirth's procedural language Pascal
es: Modo de sintaxis para el lenguaje procedural Pascal de Niklaus Wirth

source: file with syntaxmode for Larry Walls Perl
es: Modo de sintaxis para el lenguaje Perl de Larry Wall

source: Rasmus Lehrdorf PHP Hypertext Processor
es: Modo de sintaxis para el lenguaje PHP (PHP Hypertext Pre-processor) de Rasmus Lehrdorf

source: Adobe document description language Postscript
es: Modo de sintaxis para el lenguaje de descripción de documentos PostScript de Adobe
